EA/src/Documents/Маршрут.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Маршрут</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Холодильник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегионРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентИП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокДоставка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КоробкиСборки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коробка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Сборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АдресХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/Enums/ТипПрихода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипПрихода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Закупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамовывозПакеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамовывозКоробки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

EA/src/Documents/МаршрутНаАптеку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>МаршрутНаАптеку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.МестаЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Маршрут</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаклейкиМестЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КоробкиСборки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коробка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Сборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/Documents/СчетФактураВыданный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>СчетФактураВыданный</Name>
			<BasedOn>
				<xr:Item>Document.Заказ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товар</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязиПартия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/Catalogs/НаклейкиМестЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>НаклейкиМестЗаказа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Холод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМеста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/Catalogs/Партии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Партии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПроизводителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестроваяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупочнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Приходная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецпризнак</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подарок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоступности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/Documents/Маршрут/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутЗаказы.ДокДоставка КАК Заказ,
	|	МаршрутЗаказы.ДокДоставка.ТочкаСамовывоза.АдресХранения КАК АдресХранения,
	|	МаршрутНаАптеку.Ссылка КАК МаршрутНаАптеку,
	|	МаршрутЗаказы.Ссылка.Номер КАК Номер,
	|	МаршрутЗаказы.Ссылка.Дата КАК Дата,
	|	ЕСТЬNULL(НаклейкиМестЗаказа.Ссылка, ЗНАЧЕНИЕ(Справочник.НаклейкиМестЗаказа.ПустаяСсылка)) КАК МестоЗаказа
	|ИЗ
	|	Документ.Маршрут.Заказы КАК МаршрутЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутНаАптеку КАК МаршрутНаАптеку
	|		ПО МаршрутЗаказы.Ссылка = МаршрутНаАптеку.ДокументОснование
	|			И МаршрутЗаказы.ДокДоставка.ТочкаСамовывоза.АдресХранения = МаршрутНаАптеку.АдресХранения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаклейкиМестЗаказа КАК НаклейкиМестЗаказа
	|		ПО МаршрутЗаказы.ДокДоставка = НаклейкиМестЗаказа.Документ
	|ГДЕ
	|	МаршрутЗаказы.Ссылка = &Ссылка
	|	И МаршрутЗаказы.ДокДоставка <> ЗНАЧЕНИЕ(документ.Заказ.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО,
	|	МаршрутКоробкиСборки.АдресХранения,
	|	МаршрутНаАптеку.Ссылка,
	|	МаршрутКоробкиСборки.Ссылка.Номер,
	|	МаршрутКоробкиСборки.Ссылка.Дата,
	|	NULL
	|ИЗ
	|	Документ.Маршрут.КоробкиСборки КАК МаршрутКоробкиСборки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутНаАптеку КАК МаршрутНаАптеку
	|		ПО МаршрутКоробкиСборки.Ссылка = МаршрутНаАптеку.ДокументОснование
	|			И МаршрутКоробкиСборки.АдресХранения = МаршрутНаАптеку.АдресХранения
	|ГДЕ
	|	МаршрутКоробкиСборки.Ссылка = &Ссылка
	|ИТОГИ
	|	МАКСИМУМ(МаршрутНаАптеку),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата)
	|ПО
	|	АдресХранения";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ВыборкаАХ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаАХ.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаАХ.МаршрутНаАптеку) тогда
			МаршрутНаАптеку = Документы.МаршрутНаАптеку.СоздатьДокумент();
			МаршрутНаАптеку.ДокументОснование = Ссылка;
			МаршрутНаАптеку.АдресХранения = ВыборкаАХ.АдресХранения;
			МаршрутНаАптеку.Дата = ВыборкаАХ.Дата;
			МаршрутНаАптеку.НомерДокументаОснования = Формат(ВыборкаАХ.Номер,"ЧГ=");
		Иначе
			МаршрутНаАптеку = ВыборкаАХ.МаршрутНаАптеку.ПолучитьОбъект();
		КонецЕсли;
		СоставБыл = МаршрутНаАптеку.Состав.Выгрузить();
		МаршрутНаАптеку.Состав.Очистить();
		Выборка = ВыборкаАХ.Выбрать();
		Пока Выборка.Следующий() цикл
			Если Выборка.Заказ <> неопределено тогда
				НоваяСтрока = МаршрутНаАптеку.Состав.Добавить();
				НоваяСтрока.Заказ = Выборка.Заказ;
				НоваяСтрока.МестоЗаказа = Выборка.МестоЗаказа;
			КонецЕсли;
		КонецЦикла;
		СоставСтал = МаршрутНаАптеку.Состав.Выгрузить(); 
		ЗапросСравнение = Новый Запрос;
		ЗапросСравнение.Текст = 
		"ВЫБРАТЬ
		|	Было.Заказ,
		|	Было.МестоЗаказа
		|ПОМЕСТИТЬ втБыло
		|ИЗ
		|	&Было КАК Было
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Стало.Заказ,
		|	Стало.МестоЗаказа
		|ПОМЕСТИТЬ втСтало
		|ИЗ
		|	&Стало КАК Стало
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втБыло.Заказ,
		|	втБыло.МестоЗаказа,
		|	втСтало.МестоЗаказа КАК МестоЗаказа1,
		|	втСтало.Заказ КАК Заказ1
		|ИЗ
		|	втБыло КАК втБыло
		|		ПОЛНОЕ СОЕДИНЕНИЕ втСтало КАК втСтало
		|		ПО втБыло.Заказ = втСтало.Заказ
		|			И втБыло.МестоЗаказа = втСтало.МестоЗаказа
		|ГДЕ
		|	(втБыло.Заказ ЕСТЬ NULL 
		|			ИЛИ втСтало.Заказ ЕСТЬ NULL )";
		Запрос.УстановитьПараметр("Было",СоставБыл);
		Запрос.УстановитьПараметр("Стало",СоставСтал);
		Если Запрос.Выполнить().Пустой() и не КоробкиСборки.Количество() = 0 тогда
			Продолжить;
		КонецЕсли;
		МаршрутНаАптеку.Состав.Свернуть("Заказ,МестоЗаказа");
		
		МаршрутНаАптеку.КоробкиСборки.Очистить();
		
		СтрокиАХ = КоробкиСборки.НайтиСтроки(Новый Структура("АдресХранения",МаршрутНаАптеку.АдресХранения));
		Для каждого строка из СтрокиАХ цикл
			СтрКор = МаршрутНаАптеку.КоробкиСборки.Добавить();
			СтрКор.Коробка = Строка.Коробка;
		КонецЦикла;
		
		МаршрутНаАптеку.Записать(РежимЗаписиДокумента.Проведение);
		
		Если МаршрутНаАптеку.Проведен Тогда 
			СоздатьСчетаФактуры(МаршрутНаАптеку.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьСчетаФактуры(МаршрутНаАптекуСсылка);
	
	АдресХранения = МаршрутНаАптекуСсылка.АдресХранения;
	
	Если НЕ ОбщиеФункцииСервер.АдресХраненияПринадлежитФранчайзи(АдресХранения, МаршрутНаАптекуСсылка.Дата) Тогда
		  Возврат;
	КонецЕсли;
	
	МассивПакетов = МаршрутНаАптекуСсылка.Состав.ВыгрузитьКолонку("Заказ");
	
	Если МассивПакетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Заказ.ID_77 КАК ИдентификаторЗаказа
	|ИЗ
	|	Документ.Заказ КАК Заказ
	|ГДЕ
	|	Заказ.Ссылка В(&МассивПакетов)";
	
	Запрос.УстановитьПараметр("МассивПакетов", МассивПакетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказов = РезультатЗапроса.Выбрать();
	
	СтрокаУсловие = "";
	Пока ВыборкаЗаказов.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаЗаказов.ИдентификаторЗаказа) тогда
			СтрокаУсловие = СтрокаУсловие + "'"+ ВыборкаЗаказов.ИдентификаторЗаказа +"',";
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(СтрокаУсловие) тогда
		СтрокаУсловие = Лев(СтрокаУсловие,СтрДлина(СтрокаУсловие)-1);
	КонецЕсли;
	
	//	МассивКоробок = МаршрутНаАптекуСсылка.КоробкиСборки.ВыгрузитьКолонку("Коробка");
	//МассивПакетов = МаршрутНаАптекуСсылка.Состав.ВыгрузитьКолонку("Заказ");
	//
	//Если МассивКоробок.Количество() = 0 И МассивПакетов.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СборкаТовары.Документ.ID_77 КАК ИдентификаторЗаказа
	//|ПОМЕСТИТЬ ВТ_СписокЗаказов
	//|ИЗ
	//|	Документ.Сборка.Товары КАК СборкаТовары
	//|ГДЕ
	//|	СборкаТовары.Ссылка В(&МассивКоробок)
	//|	И СборкаТовары.Документ ССЫЛКА Документ.Заказ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	Заказ.ID_77
	//|ИЗ
	//|	Документ.Заказ КАК Заказ
	//|ГДЕ
	//|	Заказ.Ссылка В(&МассивПакетов)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_СписокЗаказов.ИдентификаторЗаказа
	//|ИЗ
	//|	ВТ_СписокЗаказов КАК ВТ_СписокЗаказов";
	//
	//Запрос.УстановитьПараметр("МассивКоробок", МассивКоробок);
	//Запрос.УстановитьПараметр("МассивПакетов", МассивПакетов);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаЗаказов = РезультатЗапроса.Выбрать();
	//
	//СтрокаУсловие = "";
	//Пока ВыборкаЗаказов.Следующий() Цикл
	//	Если ЗначениеЗаполнено(ВыборкаЗаказов.ИдентификаторЗаказа) тогда
	//		СтрокаУсловие = СтрокаУсловие + "'"+ ВыборкаЗаказов.ИдентификаторЗаказа +"',";
	//	КонецЕсли;
	//КонецЦикла;
	//Если ЗначениеЗаполнено(СтрокаУсловие) тогда
	//	СтрокаУсловие = Лев(СтрокаУсловие,СтрДлина(СтрокаУсловие)-1);
	//КонецЕсли;

	
	// Поиск и создание счетов фактур по найденным заказам
	
	ТекстЗапроса = 	
	"SELECT part.iddoc sf 
	|FROM Nagat..DH4287 part (nolock)
	|Inner Join Nagat.._1SJOURN Jr (nolock) ON Jr.Iddoc = part.iddoc
	|WHERE Right(part.SP4272,9)in("+СтрокаУсловие+") and Jr.ISMARK = 0";
	ТаблицаСчетовФактур = РаботаСSQL.ВыполнитьЗапросSQL(ТекстЗапроса,,Справочники.НастройкиПодключения.БазаCourierDS,Истина);
	
	МассивСчетовФактур = ТаблицаСчетовФактур.ВыгрузитьКолонку("sf");
	
	ОписаниеОбъекта77 = ОбменАлгоритмы77.ПолучитьОписаниеТаблицыВБазе77("Документ","СчетФактураВыданный");
	ТаблицаСчетовФактур = ОбменАлгоритмы77.ВыполнитьСверкуПоМетаданному(ОписаниеОбъекта77,100,,,МассивСчетовФактур,,Истина); 
	
	
	//Заполним в Счет фактуре для строк табличной части реквизит КлючСвязи
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК СФ
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ID_77 В (&ID_77)";
	
	Запрос.УстановитьПараметр("ID_77", МассивСчетовФактур);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаСФСсылки = РезультатЗапроса.Выгрузить();
	МассивСсылокДокументовСФ = ТаблицаСФСсылки.ВыгрузитьКолонку("СФ");
	Если НЕ МассивСсылокДокументовСФ.Количество() = 0 Тогда
		УстановитьИндентификаторСтрокиТЧ(МассивСсылокДокументовСФ, "Товар", "КлючСвязиПартия");
	КонецЕсли;
	
	
	//Формирование приходной накладной 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Заказ.Ссылка КАК СсылкаЗаказ,
	|	Заказ.Клиент,
	|	СчетФактураВыданный.Ссылка КАК СсылкаСФ,
	|	СчетФактураВыданный.Дата КАК ДатаСФ,
	|	СчетФактураВыданный.Номер КАК НомерСФ,
	|	Заказ.Дата КАК ДатаЗаказа,
	|	СчетФактураВыданный.Контрагент,
	|	ЕСТЬNULL(ТочкиСамовывоза.АдресХранения.ОсновнойСклад, ЗНАЧЕНИЕ(Справочник.МестаХранения.пустаяссылка)) КАК Отдел
	|ПОМЕСТИТЬ ВТ_СФЗаказ
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ КАК Заказ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТочкиСамовывоза КАК ТочкиСамовывоза
	|			ПО Заказ.ТочкаСамовывоза = ТочкиСамовывоза.Ссылка
	|		ПО СчетФактураВыданный.ДокументОснование = Заказ.Ссылка
	|ГДЕ
	|	СчетФактураВыданный.ID_77 В(&ID_77)
	|	И СчетФактураВыданный.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйТовар.Товар,
	|	СчетФактураВыданныйТовар.Партия,
	|	СчетФактураВыданныйТовар.Количество,
	|	СчетФактураВыданныйТовар.Цена,
	|	СчетФактураВыданныйТовар.СтавкаНДС,
	|	СчетФактураВыданныйТовар.Сумма,
	|	СчетФактураВыданныйТовар.СуммаНДС,
	|	СчетФактураВыданныйТовар.Всего,
	|	СчетФактураВыданныйТовар.КлючСвязиПартия,
	|	ВТ_СФЗаказ.СсылкаЗаказ,
	|	ВТ_СФЗаказ.Клиент,
	|	ВТ_СФЗаказ.Отдел,
	|	ВТ_СФЗаказ.СсылкаСФ,
	|	ВТ_СФЗаказ.ДатаСФ,
	|	ВТ_СФЗаказ.НомерСФ,
	|	ВТ_СФЗаказ.ДатаЗаказа,
	|	ВТ_СФЗаказ.Контрагент
	|ПОМЕСТИТЬ ВТ_ТЧСФ
	|ИЗ
	|	ВТ_СФЗаказ КАК ВТ_СФЗаказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Товар КАК СчетФактураВыданныйТовар
	|		ПО ВТ_СФЗаказ.СсылкаСФ = СчетФактураВыданныйТовар.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Партии.Серия, """") КАК Серия,
	|	ЕСТЬNULL(Партии.ГоденДо, ДАТАВРЕМЯ(1, 1, 1)) КАК ГоденДо,
	|	ЕСТЬNULL(Партии.Производитель, ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)) КАК Производитель,
	|	ЕСТЬNULL(Партии.Сертификат, """") КАК Сертификат,
	|	ЕСТЬNULL(Партии.СертификатДо, ДАТАВРЕМЯ(1, 1, 1)) КАК СертификатДо,
	|	ЕСТЬNULL(Партии.Выдан, """") КАК Выдан,
	|	ЕСТЬNULL(Партии.ЦенаПроизводителя, 0) КАК ЦенаПроизводителя,
	|	ЕСТЬNULL(Партии.НомерГТД, ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)) КАК НомерГТД,
	|	ЕСТЬNULL(Приходная.Ссылка, ЗНАЧЕНИЕ(Документ.Приходная.ПустаяСсылка)) КАК ПриходнаяНакладная,
	|	ВТ_ТЧСФ.Товар КАК Товар,
	|	ВТ_ТЧСФ.Количество КАК Количество,
	|	ВТ_ТЧСФ.Цена КАК Цена,
	|	ВТ_ТЧСФ.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ТЧСФ.Сумма КАК Сумма,
	|	ВТ_ТЧСФ.СуммаНДС КАК СуммаНДС,
	|	ВТ_ТЧСФ.Всего КАК Всего,
	|	ВТ_ТЧСФ.КлючСвязиПартия КАК КлючСвязиПартия,
	|	ВТ_ТЧСФ.СсылкаЗаказ КАК СсылкаЗаказ,
	|	ВТ_ТЧСФ.Отдел КАК Отдел,
	|	ВТ_ТЧСФ.СсылкаСФ КАК СчетФактура,
	|	ВТ_ТЧСФ.ДатаСФ КАК ДатаОснования,
	|	ВТ_ТЧСФ.НомерСФ КАК НомерОснования,
	|	ВТ_ТЧСФ.ДатаСФ КАК ДатаОплаты,
	|	ВТ_ТЧСФ.НомерСФ КАК НомерСЧФ,
	|	ВТ_ТЧСФ.ДатаЗаказа КАК ДатаЗаказа,
	|	ВТ_ТЧСФ.ДатаСФ КАК Дата,
	|	ВЫБОР
	|		КОГДА ВТ_ТЧСФ.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.НДС10)
	|			ТОГДА ВТ_ТЧСФ.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС10,
	|	ВЫБОР
	|		КОГДА ВТ_ТЧСФ.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.НДС18)
	|			ТОГДА ВТ_ТЧСФ.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС20,
	|	ВЫБОР
	|		КОГДА ВТ_ТЧСФ.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.НДС10)
	|			ТОГДА ВТ_ТЧСФ.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма10,
	|	ВЫБОР
	|		КОГДА ВТ_ТЧСФ.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.НДС18)
	|			ТОГДА ВТ_ТЧСФ.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма20,
	|	ВЫБОР
	|		КОГДА ВТ_ТЧСФ.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.НДС0)
	|			ТОГДА ВТ_ТЧСФ.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма0,
	|	ВТ_ТЧСФ.Контрагент КАК Клиент,
	|	ВТ_ТЧСФ.СсылкаЗаказ КАК Заказ,
	|	ЕСТЬNULL(Приходная.ТипПрихода, ЗНАЧЕНИЕ(Перечисление.ТипПрихода.СамовывозПакеты)) КАК ТипПрихода
	|ИЗ
	|	ВТ_ТЧСФ КАК ВТ_ТЧСФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Приходная КАК Приходная
	|		ПО ВТ_ТЧСФ.ДатаСФ = Приходная.ДатаОснования
	|			И ВТ_ТЧСФ.НомерСФ = Приходная.НомерОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партии КАК Партии
	|		ПО ВТ_ТЧСФ.Партия = Партии.Ссылка
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Серия),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГоденДо),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Производитель),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Сертификат),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СертификатДо),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Выдан),
	|	СУММА(ЦенаПроизводителя),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомерГТД),
	|	МАКСИМУМ(ПриходнаяНакладная),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Товар),
	|	СУММА(Количество),
	|	СУММА(Цена),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтавкаНДС),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	СУММА(Всего),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КлючСвязиПартия),
	|	МАКСИМУМ(СсылкаЗаказ),
	|	МАКСИМУМ(Отдел),
	|	МАКСИМУМ(ДатаОснования),
	|	МАКСИМУМ(НомерОснования),
	|	МАКСИМУМ(ДатаОплаты),
	|	МАКСИМУМ(НомерСЧФ),
	|	МАКСИМУМ(ДатаЗаказа),
	|	МАКСИМУМ(Дата),
	|	СУММА(СуммаНДС10),
	|	СУММА(СуммаНДС20),
	|	СУММА(Сумма10),
	|	СУММА(Сумма20),
	|	СУММА(Сумма0),
	|	МАКСИМУМ(Клиент),
	|	МАКСИМУМ(Заказ),
	|	МАКСИМУМ(ТипПрихода)
	|ПО
	|	СчетФактура";
	
	Запрос.УстановитьПараметр("ID_77", МассивСчетовФактур);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаГруппировка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруппировка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаГруппировка.ПриходнаяНакладная) Тогда
			ДокументПриходнаяНакладнаяСсылка = ВыборкаГруппировка.ПриходнаяНакладная;
			ДокументПриходнаяНакладная = ДокументПриходнаяНакладнаяСсылка.ПолучитьОбъект();
			ДокументПриходнаяНакладная.Товары.Очистить();
		Иначе
			ДокументПриходнаяНакладная = Документы.Приходная.СоздатьДокумент();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокументПриходнаяНакладная,ВыборкаГруппировка);
		
		ДокументПриходнаяНакладная.ОрдернаяСхема = 1;
		Если ЗначениеЗаполнено(ДокументПриходнаяНакладная.ДатаОплаты) тогда
			ДокументПриходнаяНакладная.РазрешенаПриемка = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаГруппировка.Клиент) Тогда
			Поставщик = ВыборкаГруппировка.Клиент;	
			ДокументПриходнаяНакладная.Упрощенка = Поставщик.Упрощенка;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументПриходнаяНакладная.Клиент) тогда
			ДокументПриходнаяНакладная.ДатаОплаты = ВыборкаГруппировка.ДатаОснования + ДокументПриходнаяНакладная.Клиент.Отсрочка*60*60*24;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи =  ВыборкаГруппировка.Выбрать(); 
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НоваяСтрока = ДокументПриходнаяНакладная.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
			
		КонецЦикла;
		
		ДокументПриходнаяНакладная.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗаписатьПартииДокументов(ВыборкаГруппировка.СчетФактура,ВыборкаГруппировка.СсылкаЗаказ, ДокументПриходнаяНакладная.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьИндентификаторСтрокиТЧ(МассивДокументов, ИмяТЧ, ИмяКлюча)
	
	Для Каждого НоваяСтрМассива Из МассивДокументов Цикл
		Если  Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(НоваяСтрМассива)) 
			И ЗначениеЗаполнено(НоваяСтрМассива)   Тогда
			ДокументОбъект = НоваяСтрМассива.ПолучитьОбъект();
			ДокументТЧ  = ДокументОбъект[ИмяТЧ];
			Если НЕ ДокументОбъект.Метаданные().ТабличныеЧасти.Найти(ИмяТЧ) = Неопределено Тогда
				Для Каждого НоваяСтрока Из ДокументТЧ Цикл
					НоваяСтрока[ИмяКлюча] = Новый УникальныйИдентификатор;
				КонецЦикла;
			КонецЕсли;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьПартииДокументов(СчетФактура, Заказ, ПриходнаяНакладная)
	
	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.Заказ") Тогда
		ЗаказОбъект = Заказ.ПолучитьОбъект();
		ТЧЗаказ = ЗаказОбъект.Товар;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СчетФактура) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ТЧСф = СчетФактура.Товар;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПриходнаяНакладная) = Тип("ДокументСсылка.Приходная") Тогда
		ТЧПриход = ПриходнаяНакладная.Товары;
	Иначе
		Возврат;
	КонецЕсли;
	
	ЕстьИзмененные = Ложь;
	Для Каждого НоваяСтрока Из ТЧПриход Цикл 
		СтрокаСФ = ТЧСф.Найти(НоваяСтрока.КлючСвязиПартия,"КлючСвязиПартия"); 
		Если НЕ СтрокаСФ = Неопределено Тогда
			СтруктураОтбора = Новый Структура("Товар,Партия",СтрокаСФ.Товар, СтрокаСФ.Партия);
			НайденныеСтрокиЗаказа = ТЧЗаказ.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтрокиЗаказа.Количество() > 0 Тогда
				НайденныеСтрокиЗаказа[0].Партия = НоваяСтрока.Партия;
				НайденныеСтрокиЗаказа[0].КлючСвязиПартия = НоваяСтрока.КлючСвязиПартия;
				НайденныеСтрокиЗаказа[0].Склад = ПриходнаяНакладная.Отдел;
				ЕстьИзмененные = Истина;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	
	Если ЕстьИзмененные Тогда
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
КонецПроцедуры
